[AshAdvWarlockM1 X2CharacterTemplate]
strCharacterName="ADVENT Warlock"

[AshAdvWarlockM2 X2CharacterTemplate]
strCharacterName="ADVENT Warlock"

[AshAdvWarlockM3 X2CharacterTemplate]
strCharacterName="ADVENT Warlock"

[AshAdvWarlockM4 X2CharacterTemplate]
strCharacterName="ADVENT Witch Killer"

[AshPsiAbominationM1 X2CharacterTemplate]
strCharacterName="Deathly Marionette"

[AshPsiAbominationM2 X2CharacterTemplate]
strCharacterName="Deathly Marionette"

[AshPsiAbominationM3 X2CharacterTemplate]
strCharacterName="Deathly Marionette"

[AshRisenTrooperM1 X2CharacterTemplate]
strCharacterName="Risen Trooper"

[AshRisenTrooperM2 X2CharacterTemplate]
strCharacterName="Risen Trooper"

[AshRisenTrooperM3 X2CharacterTemplate]
strCharacterName="Risen Trooper"

[AshRisenCursedTrooperM1 X2CharacterTemplate]
strCharacterName="Risen Trooper"

[AshRisenCursedTrooperM2 X2CharacterTemplate]
strCharacterName="Risen Trooper"

[AshRisenCursedTrooperM3 X2CharacterTemplate]
strCharacterName="Risen Trooper"

[AshRisenStunLancerM1 X2CharacterTemplate]
strCharacterName="Risen Stun Lancer"

[AshRisenStunLancerM2 X2CharacterTemplate]
strCharacterName="Risen Stun Lancer"

[AshRisenStunLancerM3 X2CharacterTemplate]
strCharacterName="Risen Stun Lancer"

[AshRisenCursedStunLancerM1 X2CharacterTemplate]
strCharacterName="Risen Stun Lancer"

[AshRisenCursedStunLancerM2 X2CharacterTemplate]
strCharacterName="Risen Stun Lancer"

[AshRisenCursedStunLancerM3 X2CharacterTemplate]
strCharacterName="Risen Stun Lancer"

[AshRisenWarlockM1 X2CharacterTemplate]
strCharacterName="Risen Warlock"

[AshRisenWarlockM2 X2CharacterTemplate]
strCharacterName="Risen Warlock"

[AshRisenWarlockM3 X2CharacterTemplate]
strCharacterName="Risen Warlock"

[AshRisenWarlockM4 X2CharacterTemplate]
strCharacterName="Risen Warlock"

[AshArmoredTrooperM1 X2CharacterTemplate]
strCharacterName="Cursed Trooper"

[AshArmoredTrooperM2 X2CharacterTemplate]
strCharacterName="Cursed Trooper"

[AshArmoredTrooperM3 X2CharacterTemplate]
strCharacterName="Cursed Trooper"

[AshCursedStunLancerM1 X2CharacterTemplate]
strCharacterName="Cursed Stun Lancer"

[AshCursedStunLancerM2 X2CharacterTemplate]
strCharacterName="Cursed Stun Lancer"

[AshCursedStunLancerM3 X2CharacterTemplate]
strCharacterName="Cursed Stun Lancer"

[Ability_AshCovenant X2AbilityTemplate]
LocFriendlyName="Covenant"
LocLongDescription="Revives a slain warlock at the cost of a cursed trooper."
LocHelpText="Revives a slain warlock at the cost of a cursed trooper."
LocFlyOverText="Covenant"

[Passive_AshWitchKiller X2AbilityTemplate]
LocFriendlyName="Witch Killer"
LocLongDescription="Witch Killers do increased damage against Psi Operatives and ADVENT Warlocks with their Psionic Reaper."
LocHelpText="Witch Killers do increased damage against Psi Operatives and ADVENT Warlocks with their Psionic Reaper."

[Ability_AshWitchKiller X2AbilityTemplate]
LocFriendlyName="Witch Killer"
LocLongDescription="Witch Killers do increased damage against Psi Operatives and ADVENT Warlocks with their Psionic Reaper."
LocHelpText="Witch Killers do increased damage against Psi Operatives and ADVENT Warlocks with their Psionic Reaper."
LocFlyOverText="Witch Killer"

[Ability_AshBurnTheWitchM1 X2AbilityTemplate]
LocFriendlyName="Burn the Witch"
LocLongDescription="Engulf a Psi Operative in a psionic conflagration."
LocHelpText="Engulf a Psi Operative in a psionic conflagration."
LocFlyOverText="Burn the Witch"

[Ability_AshBurnTheWitchM2 X2AbilityTemplate]
LocFriendlyName="Burn the Witch"
LocLongDescription="Engulf a Psi Operative in an unresistable psionic conflagration."
LocHelpText="Engulf a Psi Operative in an unresistable psionic conflagration."
LocFlyOverText="Burn the Witch"

[Ability_AshDeathsEmbraceM1 X2AbilityTemplate]
LocFriendlyName="Deathly Marionette"
LocLongDescription="Sacrifice an ADVENT Trooper and empower yourself with its soul."
LocHelpText="Sacrifice an ADVENT Trooper and empower yourself with its soul."
LocFlyOverText="Deathy Marionette"

[Ability_AshDeathsEmpowermentM1 X2AbilityTemplate]
LocFriendlyName="Convergence"
LocLongDescription="Empowers the Warlock with life and defensive bonuses."
LocHelpText="Empowers the Warlock with defensive bonuses."
LocFlyOverText="Convergence"

[Ability_AshDeathsEmpowermentM2 X2AbilityTemplate]
LocFriendlyName="Convergence"
LocLongDescription="Empowers the Warlock with defensive bonuses."
LocHelpText="Empowers the Warlock with defensive bonuses."
LocFlyOverText="Convergence"

[Ability_AshDeathsEmpowermentM3 X2AbilityTemplate]
LocFriendlyName="Convergence"
LocLongDescription="Empowers the Warlock with defensive bonuses."
LocHelpText="Empowers the Warlock with defensive bonuses."
LocFlyOverText="Convergence"

[Ability_AshZombieSlashM1 X2AbilityTemplate]
LocFriendlyName="Stumbling Slash"
LocLongDescription="Make a melee attack against a target that shreds armor."
LocHelpText="Make a melee attack against a target that shreds armor."
LocFlyOverText="Abomination Slash"

[Ability_AshZombieSlashM2 X2AbilityTemplate]
LocFriendlyName="Stumbling Slash"
LocLongDescription="Make a melee attack against a target that shreds armor."
LocHelpText="Make a melee attack against a target that shreds armor."
LocFlyOverText="Abomination Slash"

[Ability_AshZombieSlashM3 X2AbilityTemplate]
LocFriendlyName="Stumbling Slash"
LocLongDescription="Make a melee attack against a target that shreds armor."
LocHelpText="Make a melee attack against a target that shreds armor."
LocFlyOverText="Stumbling Slash"

[Ability_AshWanderingCurse X2AbilityTemplate]
LocFriendlyName="Wandering Curse"
LocLongDescription="Raises a nearby dead ADVENT Trooper or Warlock."
LocHelpText="Raises a nearby dead ADVENT Trooper or Warlock."
LocFlyOverText="Wandering Curse"

[Ability_AshResilienceM1 X2AbilityTemplate]
LocFriendlyName="Resilience"
LocLongDescription="Risen Troopers become increasingly difficult to kill."
LocHelpText="Risen Troopers become increasingly difficult to kill."
LocFlyOverText="Resilience"

[Ability_AshResilienceM2 X2AbilityTemplate]
LocFriendlyName="Resilience"
LocLongDescription="Risen Troopers become increasingly difficult to kill."
LocHelpText="Risen Troopers become increasingly difficult to kill."
LocFlyOverText="Resilience"

[Ability_AshResilienceM3 X2AbilityTemplate]
LocFriendlyName="Resilience"
LocLongDescription="Risen Troopers become increasingly difficult to kill."
LocHelpText="Risen Troopers become increasingly difficult to kill."
LocFlyOverText="Resilience"

[Ability_AshPhantomSlayerRounds X2AbilityTemplate]
LocFriendlyName="Slayer Rounds"

[Ability_AshPsionicMiasma X2AbilityTemplate]
LocFriendlyName="Psionic Miasma"
LocLongDescription="Greatly increases defense by obscuring the Risen from sight."
LocHelpText="Greatly increases defense by obscuring the Risen from sight."
LocFlyOverText="Psionic Miasma"

[Ability_AshNightTerrors X2AbilityTemplate]
LocFriendlyName="Night Terrors"
LocLongDescription="Causes soldiers to panic and acquire the Night Terrors Trait."
LocHelpText="Causes soldiers to panic and acquire the Night Terrors Trait."
LocFlyOverText="Night Terrors"
LocMissMessage="Night Terrors Resisted"

[Ability_AshShootTheWitch X2AbilityTemplate]
LocFriendlyName="Shoot The Witch"
LocLongDescription="Fire a Psionic Reaper at a Psi Operative."
LocHelpText="Fire a Psionic Reaper at a Psi Operative."
LocFlyOverText="Shoot The Witch"

[Trait_AshNightTerrors X2TraitTemplate]
TraitFriendlyName="Night Terrors"
TraitScientificName="Noctis Terrores"
TraitDescription="Chance to become Obsessed, Berserk, Panicked, or Shattered when encountering Risen, Warlocks, and Witch Killers."
TraitQuotes[0]="\"What was that... ?!\""
TraitQuotes[1]="\"Some things really do go bump in the night.\""
TraitQuotes[2]="\"Now I'm more afraid of going to sleep than I am of staying awake...\""
TraitQuotes[3]="\"I always thought dreams were supposed to come true... not nightmares.\""

[TraitAbility_AshNightTerrorsPassive X2AbilityTemplate]
LocFriendlyName="Night Terrors"
LocLongDescription="This unit may panic at the sight of Risen, ADVENT Warlocks and Witch Killers."
LocHelpText="This unit may panic at the sight of Risen, ADVENT Warlocks and Witch Killers."
LocFlyOverText="Night Terrors"

[Weapon_AshAdvWarlockPsionicReaperM1 X2WeaponTemplate]
FriendlyName="Psionic Reaper"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn.\n<bullet/> Psionic Reapers fire deadly psionic energy, penetrating heavy armor."
BriefSummary = "The Psionic Reaper channels the ADVENT Warlock's own Psionic energy.  As such, it has nearly limitless ammunition and bypasses a moderate amount of armor."

[Weapon_AshAdvWarlockPsionicReaperM2 X2WeaponTemplate]
FriendlyName="Psionic Reaper"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn.\n<bullet/> Psionic Reapers fire deadly psionic energy, penetrating heavy armor."
BriefSummary = "The Psionic Reaper channels the ADVENT Warlock's own Psionic energy.  As such, it has nearly limitless ammunition and bypasses a moderate amount of armor."

[Weapon_AshAdvWarlockPsionicReaperM3 X2WeaponTemplate]
FriendlyName="Psionic Reaper"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn.\n<bullet/> Psionic Reapers fire deadly psionic energy, penetrating heavy armor."
BriefSummary = "The Psionic Reaper channels the ADVENT Warlock's own Psionic energy.  As such, it has nearly limitless ammunition and bypasses a moderate amount of armor."

[Weapon_AshAdvWarlockPsiAmpM1 X2WeaponTemplate]
FriendlyName="ADVENT Warlock Psi Amp"

[Weapon_AshAdvWarlockPsiAmpM2 X2WeaponTemplate]
FriendlyName="ADVENT Warlock Psi Amp"

[Weapon_AshAdvWarlockPsiAmpM3 X2WeaponTemplate]
FriendlyName="ADVENT Warlock Psi Amp"

[Weapon_AshXcomPsionicReaper X2WeaponTemplate]
FriendlyName="Psionic Reaper"
TacticalText = "<bullet/> Firing the primary weapon always ends the soldier's turn.\n<bullet/> Psionic Reapers fire deadly psionic energy that penetrates heavy armor.\n<bullet/> Drawing on the PsiOperative's own Psionic energy, Psionic Reapers have nearly limitless ammunition.\n<bullet/> Psionic Reapers gain accuracy bonuses at short and medium ranges."
BriefSummary = "The Psionic Reaper channels a PsiOperative's own Psionic energy.  As such, it has nearly limitless ammunition and penetrates heavy armor."

[Weapon_AshXcomVortexGrenade X2GrenadeTemplate]
FriendlyName = "Vortex Grenade"
FriendlyNamePlural="Vortex Grenades"
BriefSummary="Upon detonation, this grenade creates a Psionic vortex that tears real space itself, resulting in significant damage to victims and the environment.  Targets in the blast may be stunned."
TacticalText="<bullet/>Being lighter in weight, Vortex grenades can be thrown and launched further than frag grenades and do not hinder soldier movement.\n<bullet/> The psionic vortex unleashed by this grenade causes massive damage to the environment, leaving very little cover for enemies to hide behind.\n<bullet/>Victims caught in the vortex have a chance to be stunned."
ThrownAbilityName="Throw Vortex Grenade"
ThrownAbilityHelpText="Throw a vortex grenade at target area.  Does damage and causes massive damage to the environment.  Targets in the area have a chance to be stunned."
LaunchedAbilityname="Launch Vortex Grenade"
LaunchedAbilityHelpText="Launch a vortex grenade at target area.  Does damage and causes massive damage to the environment.  Targets in the area have a chance to be stunned."

[Weapon_AshAdvWarlockVortexGrenadeM1 X2GrenadeTemplate]
FriendlyName = "Vortex Grenade"
FriendlyNamePlural="Vortex Grenades"
BriefSummary="Upon detonation, this grenade creates a Psionic vortex that tears real space itself, resulting in significant damage to victims and the environment.  Targets in the blast may be stunned."
TacticalText="<bullet/>Being more lightweight, Vortex grenades can be thrown and launched further than other grenades.\n<bullet/> The psionic vortex unleashed by this grenade causes massive damage to the environment, leaving very little cover for enemies to hide behind.\n<bullet/>Victims caught in the vortex have a chance to be stunned."
ThrownAbilityName="Throw Vortex Grenade"
ThrownAbilityHelpText="Throw a vortex grenade at target area.  Does damage and causes massive damage to the environment.  Targets in the area have a chance to be stunned."
LaunchedAbilityname="Launch Vortex Grenade"
LaunchedAbilityHelpText="Launch a vortex grenade at target area.  Does damage and causes massive damage to the environment.  Targets in the area have a chance to be stunned."

[Weapon_AshAdvWarlockVortexGrenadeM2 X2GrenadeTemplate]
FriendlyName = "Vortex Grenade"
FriendlyNamePlural="Vortex Grenades"
BriefSummary="Upon detonation, this grenade creates a Psionic vortex that tears real space itself, resulting in significant damage to victims and the environment.  Targets in the blast may be stunned."
TacticalText="<bullet/>Being more lightweight, Vortex grenades can be thrown and launched further than other grenades.\n<bullet/> The psionic vortex unleashed by this grenade causes massive damage to the environment, leaving very little cover for enemies to hide behind.\n<bullet/>Victims caught in the vortex have a chance to be stunned."
ThrownAbilityName="Throw Vortex Grenade"
ThrownAbilityHelpText="Throw a vortex grenade at target area.  Does damage and causes massive damage to the environment.  Targets in the area have a chance to be stunned."
LaunchedAbilityname="Launch Vortex Grenade"
LaunchedAbilityHelpText="Launch a vortex grenade at target area.  Does damage and causes massive damage to the environment.  Targets in the area have a chance to be stunned."

[Weapon_AshAdvWarlockVortexGrenadeM3 X2GrenadeTemplate]
FriendlyName = "Vortex Grenade"
FriendlyNamePlural="Vortex Grenades"
BriefSummary="Upon detonation, this grenade creates a Psionic vortex that tears real space itself, resulting in significant damage to victims and the environment.  Targets in the blast may be stunned."
TacticalText="<bullet/>Being more lightweight, Vortex grenades can be thrown and launched further than other grenades.\n<bullet/> The psionic vortex unleashed by this grenade causes massive damage to the environment, leaving very little cover for enemies to hide behind.\n<bullet/>Victims caught in the vortex have a chance to be stunned."
ThrownAbilityName="Throw Vortex Grenade"
ThrownAbilityHelpText="Throw a vortex grenade at target area.  Does damage and causes massive damage to the environment.  Targets in the area have a chance to be stunned."
LaunchedAbilityname="Launch Vortex Grenade"
LaunchedAbilityHelpText="Launch a vortex grenade at target area.  Does damage and causes massive damage to the environment.  Targets in the area have a chance to be stunned."

[Weapon_AshWanderingCurse X2AbilityTemplate]
LocFriendlyName="Wandering Curse"
LocLongDescription="Curses the nearby dead to rise."
LocHelpText="Curses the nearby dead to rise."
LocFlyOverText="Wandering Curse"

[UtilityItem_AshPhantomSlayerRounds X2AmmoTemplate]
FriendlyName="Phantom Slayer Rounds"
TacticalText = "<bullet/> Phantom Slayer Rounds are upgraded versions of our Armor Piercing Rounds; maintaining their effectiveness against armored targets.  Additionally, they are devastatingly effective against the so-called 'Zombies' that we've encountered."
BriefSummary = "Phantom Slayer Rounds incorporate a warhead of elerium-laced flechettes that disrupt the psionic energies that control the dead as well as destroying the rotting tissue of The Lost."

[Corpse_AshAdvWarlock X2ItemTemplate]
FriendlyName="ADVENT Warlock Corpse"
FriendlyNamePlural="ADVENT Warlock Corpses"
BriefSummary="On the outside, this creature appears to be no different than any other Advent soldier.  The ADVENT Warlock, however, possesses a formidable array of psionic abilities."

[Research_AshPsionicWeapons X2TechTemplate]
DisplayName="Psionic Weapons"
Summary="Now that we have the ability to train our own soldiers to use Psionics, we can turn or efforts to developing weaponry that harnesses that very power.  If we can fabricate a weapon that allows its wielder to focus and direct its own Psionic energy, its application in the field would be invaluable."
CodeName="Reaper"
LongDescription="It was only a matter of time before making a breakthrough into Psionically powered weapons.  We now have access to a weapon that can be deployed with our own PsiOperatives that is not restricted by the need to carry ammunition.  Additionally, this weapons discharge has little regard for the laws of physics, passing directly through the defenses of everything but the most heavily armored targets.  Finally, we can begin turning the ADVENT Warlocks own weapon against the aliens.  R. Tygan. "

[ProvingGround_AshPsiInfusedGrenades X2TechTemplate]
DisplayName="Vortex Grenade"
Summary="With our ongoing research of Psionics, a logical next step would be to experiment with methods of infusing grenades with Psionic energy.  This may allow our non-gifted soldiers to carry Psionic weapons."

[Autopsy_AshAdvWarlock X2TechTemplate]
DisplayName="ADVENT Warlock Autopsy"
Summary="Physically, the ADVENT Warlock appears no different than the rank-and-file ADVENT Troopers.  Their ability to manipulate psionic energy, however, reveals that the aliens are continuing to evolve their human-alien hybrid experiments."
CodeName="Witch King"
LongDescription="Despite being physically and genetically identical to the typical ADVENT Trooper, our forces report encountering the ADVENT Warlocks in less numbers.  This may be an indication that the aliens cannot produce this human-alien hybrid as quickly.  It may take considerable time to infuse the Warlocks with their Psionic abilities.  This is of little comfort to our soldiers as they have witnessed the ADVENT Warlock mind controlling the dead in battle, even after its own expiration.  Further increasing the threat level of this creature, the ADVENT Warlock is deployed into the field carrying fully automatic weaponry powered by its own Psionic energy.  Perhaps given enough time and specimens, our research can reverse-engineer this weaponry for our own use.  R. Tygan."

[Schematic_AshXcomPsionicReaper X2SchematicTemplate]
FriendlyName="Psionic Reaper"
BriefSummary = "The Psionic Reaper is powered by a PsiOperative's own Psionic energy.  As such, it has nearly limitless ammunition and is capable of penetrating heavy armor."